[
    {
        "company": "DHL Supply Chain India Pvt. Ltd.",
        "company_location": "Mumbai, MH",
        "role": "Assistant Manager ",
        "team": "WMS IT",
        "time_duration": "Feb 2024 - Present",
        "details": [
        	{
                "title": "MAWM Active",
                "description": "Configuration of MAWM Active project. EDI mapping and designing of API functional flows. Delivered successful SIT and UAT training programs ensuring smooth user adoption by DC operations team.",
                "languages":"JSON ZPL GitLAB"
            },
        	{
                "title": "Analytics",
                "description": "Implemented KPI dashboards (leveraging company SaaS platform) for enhanced visibility and data-driven decision making. Created insightful reports using IBM Cognos for comprehensive supply chain analysis. Developed dynamic dashboards on Power BI to facilitate real-time performance monitoring.",
                "languages": "Python SQL"
            },
            {
                "title": "OS migration",
                "description": "Successfully managed the complete end-to-end UAT of WMOS 2017 during the RHEL 8 Linux OS upgrade project, ensuring a smooth transition. (delivered in 75 days)",
                "languages": "DAX"
            }
        ]
    },
    {
        "company": "DHL Supply Chain India Pvt. Ltd.",
        "company_location": "Mumbai, MH",
        "role": "Graduate Engineering Trainee ",
        "team": "WMS IT",
        "time_duration": "Jul 2022 - Jan 2024",
        "details": [
            {
                "title": "WMOS 2017",
                "description": "Led team in implementing WMS for a leading multinational footwear brand's omnichannel operations. Oversaw the entire UAT process, ensuring smooth system integration with marketplaces.",
                "languages": "JSON ZPL GITLAB Jasper MS-Office"
            },
            {
                    "title": "Post Go-live support",
                    "description": "Designed solutions for inventory optimization after system launch. Negotiated and delivered optimal solutions based on customer technical team requirements.",
                    "languages": "SQL VBA"
            },
            {
                "title": "Customer & Operational Support",
                "description": "Addressed customer and operational needs related to printing, inventory reporting, and process improvement. Ensured customer satisfaction by consistently delivering optimal solutions.",
               	"languages": "SQL ZPL"
            }
        ]
    },
    {
        "company": "DHL Supply Chain India Pvt. Ltd.",
        "company_location": "Mumbai, MH",
        "role": "Intern",
        "team": "",
        "time_duration": "Apr 2022 - May 2022",
        "details": [
            {
                "title": "Comprehensive Warehouse Business Analysis",
                "description": "Conducted a deep dive into warehouse operations, analyzing IT, transportation, and operational processes. Presented findings to senior leadership (Board of Vice Presidents).",
                "languages": "VBA MS-Office"
            },
            {
                "title": "WMS Configuration",
                "description": "Successfully configured a retail cosmetics business unit in WMOS 2017 (QA environment) after thoroughly studying the production environment. Demonstrated proficiency in WMS configuration.",
                "languages": "WMOS 2017"
            }
        ]
    },
    {
        "company": "Storaku LLP",
        "company_location": "Mumbai, MH",
        "role": "Founder & CEO",
        "team": "",
        "time_duration": "Sept 2020 - Mar 2022",
        "details": [
            {
                "title": "",
                "description": "Storaku an e- commerce company specializing in pop culture merchandising.",
                "languages": ""
            },
            {
                "title": "",
                "description": "Secured funding and resources to drive business growth. Actively participated in generating product ideas and overseeing website development.",
                "languages": "JIRA AWS"
            },
            {
                "title": "",
                "description": "Managed intern tasks and optimized operational logistics for efficient business operations.",
                "languages": "MS-Office Illustrator"
            }
        ]
    },
    {
        "company": "Larsen & Toubro Limited",
        "company_location": "Mumbai, MH",
        "role": "Metallurgy Engineer Intern",
        "team": "",
        "time_duration": "Nov 2018 - May 2019",
        "details": [
            {
                "title": "",
                "description": "Conducted a metallurgical study on 310MoLN tubes at elevated temperatures, systematically analyzing microstructural changes and carbon corrosion. The primary objective of this study was to ascertain the optimum working temperature of these tubes within the context of a urea plant.",
                "languages": "MS-Office"
            },
            {
                "title": "",
                "description": "Developed an Impact Test Exemption Calculator utilizing VBA and referencing ASME standards. This innovative tool significantly streamlined the process of determining exemption factors, resulting in a remarkable 70% reduction in decision-making time.",
                "languages": "Excel VBA"
            },
            {
                "title": "",
                "description": "Management of a DISH seminar and underwent welding training.",
                "languages": ""
            }
        ]
    },
    {
        "company": "Godrej & Boyce Mfg. Co. Ltd.",
        "company_location": "Mumbai, MH",
        "role": "Design Engineer Intern",
        "team": "",
        "time_duration": "Jun 2017 - Nov 2017",
        "details": [
            {
                "title": "",
                "description": "Modeling and drafting of material handling equipment on Creo 2.0",
                "languages": "Creo 2.0"
            },
            {
                "title": "",
                "description": "Designing of forklift overhead shaft.",
                "languages": "Auto CAD"
            },
            {
                "title": "",
                "description": "Served as an assistant in destructive testing and analysis of materials for quality assurance purposes using Hypermesh.",
                "languages": "Excel"
            }
        ]
    }
]
